<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//RU"  
  "http://www.w3.org/TR/html4/loose.dtd">  
<html xml:lang="ru" > 
<head><title>&#x0413;&#x043B;&#x0443;&#x0431;&#x043E;&#x043A;&#x043E;&#x0435; &#x043E;&#x0431;&#x0443;&#x0447;&#x0435;&#x043D;&#x0438;&#x0435; &#x0432; &#x0437;&#x0430;&#x0434;&#x0430;&#x0447;&#x0430;&#x0445; &#x043A;&#x043B;&#x0430;&#x0441;&#x0441;&#x0438;&#x0444;&#x0438;&#x043A;&#x0430;&#x0446;&#x0438;&#x0438; &#x0432;&#x0440;&#x0435;&#x043C;&#x0435;&#x043D;&#x043D;&#x044B;&#x0445; &#x0440;&#x044F;&#x0434;&#x043E;&#x0432;</title> 
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-5"> 
<meta name="generator" content="TeX4ht (http://www.cse.ohio-state.edu/~gurari/TeX4ht/)"> 
<meta name="originator" content="TeX4ht (http://www.cse.ohio-state.edu/~gurari/TeX4ht/)"> 
<!-- html --> 
<meta name="src" content="article2.tex"> 
<meta name="date" content="2016-05-13 21:05:00"> 
<link rel="stylesheet" type="text/css" href="article2.css"> 
</head><body 
>
   <div class="maketitle">



<h2 class="titleHead">&#x0413;&#x043B;&#x0443;&#x0431;&#x043E;&#x043A;&#x043E;&#x0435; &#x043E;&#x0431;&#x0443;&#x0447;&#x0435;&#x043D;&#x0438;&#x0435; &#x0432; &#x0437;&#x0430;&#x0434;&#x0430;&#x0447;&#x0430;&#x0445; &#x043A;&#x043B;&#x0430;&#x0441;&#x0441;&#x0438;&#x0444;&#x0438;&#x043A;&#x0430;&#x0446;&#x0438;&#x0438;
&#x0432;&#x0440;&#x0435;&#x043C;&#x0435;&#x043D;&#x043D;&#x044B;&#x0445; &#x0440;&#x044F;&#x0434;&#x043E;&#x0432;</h2>
<div class="author" ></div><br />
<div class="date" ></div>
   </div>
<div class="center" 
>
<!--l. 22--><p class="noindent" >
<!--l. 23--><p class="noindent" >&#x041E;. &#x042E;.&#x00A0;&#x0411;&#x0430;&#x0445;&#x0442;&#x0435;&#x0435;&#x0432;<br />
&#x041C;&#x043E;&#x0441;&#x043A;&#x043E;&#x0432;&#x0441;&#x043A;&#x0438;&#x0439; &#x0444;&#x0438;&#x0437;&#x0438;&#x043A;&#x043E;-&#x0442;&#x0435;&#x0445;&#x043D;&#x0438;&#x0447;&#x0435;&#x0441;&#x043A;&#x0438;&#x0439; &#x0438;&#x043D;&#x0441;&#x0442;&#x0438;&#x0442;&#x0443;&#x0442;, bakhteev@phystech.edu,<br />
&#x041C;. &#x0421;.&#x00A0;&#x041F;&#x043E;&#x043F;&#x043E;&#x0432;&#x0430;<br />
&#x041C;&#x043E;&#x0441;&#x043A;&#x043E;&#x0432;&#x0441;&#x043A;&#x0438;&#x0439; &#x0444;&#x0438;&#x0437;&#x0438;&#x043A;&#x043E;-&#x0442;&#x0435;&#x0445;&#x043D;&#x0438;&#x0447;&#x0435;&#x0441;&#x043A;&#x0438;&#x0439; &#x0438;&#x043D;&#x0441;&#x0442;&#x0438;&#x0442;&#x0443;&#x0442;, maria_popova@phystech.edu,<br />
&#x0412;. &#x0412;.&#x00A0;&#x0421;&#x0442;&#x0440;&#x0438;&#x0436;&#x043E;&#x0432;<br />
&#x0412;&#x044B;&#x0447;&#x0438;&#x0441;&#x043B;&#x0438;&#x0442;&#x0435;&#x043B;&#x044C;&#x043D;&#x044B;&#x0439; &#x0446;&#x0435;&#x043D;&#x0442;&#x0440; &#x0438;&#x043C;. &#x0410;.&#x00A0;&#x0410;. &#x0414;&#x043E;&#x0440;&#x043E;&#x0434;&#x043D;&#x0438;&#x0446;&#x044B;&#x043D;&#x0430; &#x0424;&#x0418;&#x0426; &#x0418;&#x0423; &#x0420;&#x0410;&#x041D;, strijov@ccas.ru</div>
<!--l. 32--><p class="indent" >   <span 
class="labx-1200">&#x041A;&#x043B;&#x044E;&#x0447;&#x0435;&#x0432;&#x044B;&#x0435; &#x0441;&#x043B;&#x043E;&#x0432;&#x0430;</span>: &#x043A;&#x043B;&#x0430;&#x0441;&#x0441;&#x0438;&#x0444;&#x0438;&#x043A;&#x0430;&#x0446;&#x0438;&#x044F; &#x0432;&#x0440;&#x0435;&#x043C;&#x0435;&#x043D;&#x043D;&#x044B;&#x0445; &#x0440;&#x044F;&#x0434;&#x043E;&#x0432;; &#x0433;&#x043B;&#x0443;&#x0431;&#x043E;&#x043A;&#x043E;&#x0435; &#x043E;&#x0431;&#x0443;&#x0447;&#x0435;&#x043D;&#x0438;&#x0435;; &#x0441;&#x0443;&#x043F;&#x0435;&#x0440;&#x043F;&#x043E;&#x0437;&#x0438;&#x0446;&#x0438;&#x044F;
&#x043C;&#x043E;&#x0434;&#x0435;&#x043B;&#x0435;&#x0439;; &#x0430;&#x0432;&#x0442;&#x043E;&#x043A;&#x043E;&#x0434;&#x0438;&#x0440;&#x043E;&#x0432;&#x0449;&#x0438;&#x043A;; &#x043E;&#x0433;&#x0440;&#x0430;&#x043D;&#x0438;&#x0447;&#x0435;&#x043D;&#x043D;&#x0430;&#x044F; &#x043C;&#x0430;&#x0448;&#x0438;&#x043D;&#x0430; &#x0411;&#x043E;&#x043B;&#x044C;&#x0446;&#x043C;&#x0430;&#x043D;&#x0430;; Theano; Amazon Web
Services
<!--l. 34--><p class="indent" >   &#x0420;&#x0435;&#x0448;&#x0430;&#x0435;&#x0442;&#x0441;&#x044F; &#x0437;&#x0430;&#x0434;&#x0430;&#x0447;&#x0430; &#x043A;&#x043B;&#x0430;&#x0441;&#x0441;&#x0438;&#x0444;&#x0438;&#x043A;&#x0430;&#x0446;&#x0438;&#x0438; &#x0432;&#x0440;&#x0435;&#x043C;&#x0435;&#x043D;&#x043D;&#x044B;&#x0445; &#x0440;&#x044F;&#x0434;&#x043E;&#x0432; &#x0430;&#x043A;&#x0441;&#x0435;&#x043B;&#x0435;&#x0440;&#x043E;&#x043C;&#x0435;&#x0442;&#x0440;&#x0430; &#x043C;&#x043E;&#x0431;&#x0438;&#x043B;&#x044C;&#x043D;&#x043E;&#x0433;&#x043E; &#x0442;&#x0435;&#x043B;&#x0435;&#x0444;&#x043E;&#x043D;&#x0430;.
&#x0421;&#x0442;&#x0440;&#x043E;&#x0438;&#x0442;&#x0441;&#x044F; &#x0441;&#x0435;&#x0442;&#x044C; &#x0433;&#x043B;&#x0443;&#x0431;&#x043E;&#x043A;&#x043E;&#x0433;&#x043E; &#x043E;&#x0431;&#x0443;&#x0447;&#x0435;&#x043D;&#x0438;&#x044F;. &#x0421;&#x0442;&#x0440;&#x0443;&#x043A;&#x0442;&#x0443;&#x0440;&#x0430; &#x0441;&#x0435;&#x0442;&#x0438; &#8212; &#x043A;&#x043E;&#x043C;&#x043F;&#x043E;&#x0437;&#x0438;&#x0446;&#x0438;&#x044F; &#x043E;&#x0433;&#x0440;&#x0430;&#x043D;&#x0438;&#x0447;&#x0435;&#x043D;&#x043D;&#x043E;&#x0439; &#x043C;&#x0430;&#x0448;&#x0438;&#x043D;&#x044B;
&#x0411;&#x043E;&#x043B;&#x044C;&#x0446;&#x043C;&#x0430;&#x043D;&#x0430;, &#x0430;&#x0432;&#x0442;&#x043E;&#x043A;&#x043E;&#x0434;&#x0438;&#x0440;&#x043E;&#x0432;&#x0449;&#x0438;&#x043A;&#x0430; &#x0438; &#x0434;&#x0432;&#x0443;&#x0445;&#x0441;&#x043B;&#x043E;&#x0439;&#x043D;&#x043E;&#x0439; &#x043D;&#x0435;&#x0439;&#x0440;&#x043E;&#x0441;&#x0435;&#x0442;&#x0438;. &#x0410;&#x043D;&#x0430;&#x043B;&#x0438;&#x0437;&#x0438;&#x0440;&#x0443;&#x0435;&#x0442;&#x0441;&#x044F; &#x0437;&#x0430;&#x0432;&#x0438;&#x0441;&#x0438;&#x043C;&#x043E;&#x0441;&#x0442;&#x044C;
&#x043E;&#x0448;&#x0438;&#x0431;&#x043A;&#x0438; &#x043A;&#x043B;&#x0430;&#x0441;&#x0441;&#x0438;&#x0444;&#x0438;&#x043A;&#x0430;&#x0446;&#x0438;&#x0438; &#x043E;&#x0442; &#x0447;&#x0438;&#x0441;&#x043B;&#x0430; &#x043F;&#x0430;&#x0440;&#x0430;&#x043C;&#x0435;&#x0442;&#x0440;&#x043E;&#x0432; &#x0438; &#x0440;&#x0430;&#x0437;&#x043C;&#x0435;&#x0440;&#x0430; &#x043E;&#x0431;&#x0443;&#x0447;&#x0430;&#x044E;&#x0449;&#x0435;&#x0439; &#x0432;&#x044B;&#x0431;&#x043E;&#x0440;&#x043A;&#x0438;. &#x0420;&#x0430;&#x0431;&#x043E;&#x0442;&#x0430;
&#x043F;&#x043E;&#x0441;&#x0432;&#x044F;&#x0449;&#x0435;&#x043D;&#x0430; &#x043F;&#x043E;&#x0441;&#x0442;&#x0440;&#x043E;&#x0435;&#x043D;&#x0438;&#x044E; &#x0441;&#x0435;&#x0442;&#x0438; &#x0433;&#x043B;&#x0443;&#x0431;&#x043E;&#x043A;&#x043E;&#x0433;&#x043E; &#x043E;&#x0431;&#x0443;&#x0447;&#x0435;&#x043D;&#x0438;&#x044F; &#x0438; &#x043E;&#x043F;&#x0442;&#x0438;&#x043C;&#x0438;&#x0437;&#x0430;&#x0446;&#x0438;&#x0438; &#x0435;&#x0435; &#x043F;&#x0430;&#x0440;&#x0430;&#x043C;&#x0435;&#x0442;&#x0440;&#x043E;&#x0432; &#x0441; &#x043F;&#x043E;&#x043C;&#x043E;&#x0449;&#x044C;&#x044E;
&#x0432;&#x044B;&#x0447;&#x0438;&#x0441;&#x043B;&#x0438;&#x0442;&#x0435;&#x043B;&#x044C;&#x043D;&#x044B;&#x0445; &#x043C;&#x043E;&#x0449;&#x043D;&#x043E;&#x0441;&#x0442;&#x0435;&#x0439; &#x0433;&#x0440;&#x0430;&#x0444;&#x0438;&#x0447;&#x0435;&#x0441;&#x043A;&#x043E;&#x0433;&#x043E; &#x0443;&#x0441;&#x043A;&#x043E;&#x0440;&#x0438;&#x0442;&#x0435;&#x043B;&#x044F; &#x043D;&#x0430; &#x043E;&#x0441;&#x043D;&#x043E;&#x0432;&#x0435; &#x0441;&#x0435;&#x0440;&#x0432;&#x0438;&#x0441;&#x0430; &#x043E;&#x0431;&#x043B;&#x0430;&#x0447;&#x043D;&#x044B;&#x0445;
&#x0432;&#x044B;&#x0447;&#x0438;&#x0441;&#x043B;&#x0435;&#x043D;&#x0438;&#x0439; Amazon Web Services.
<!--l. 36--><p class="indent" >   &#x042D;&#x043A;&#x0441;&#x043F;&#x0435;&#x0440;&#x0438;&#x043C;&#x0435;&#x043D;&#x0442; &#x043F;&#x0440;&#x043E;&#x0432;&#x043E;&#x0434;&#x0438;&#x0442;&#x0441;&#x044F; &#x0441; &#x0438;&#x0441;&#x043F;&#x043E;&#x043B;&#x044C;&#x0437;&#x043E;&#x0432;&#x0430;&#x043D;&#x0438;&#x0435;&#x043C; Theano &#8212; &#x0431;&#x0438;&#x0431;&#x043B;&#x0438;&#x043E;&#x0442;&#x0435;&#x043A;&#x0438; &#x0434;&#x043B;&#x044F; &#x0432;&#x044B;&#x0447;&#x0438;&#x0441;&#x043B;&#x0435;&#x043D;&#x0438;&#x0439; &#x0434;&#x043B;&#x044F;
&#x044F;&#x0437;&#x044B;&#x043A;&#x0430; Python. Theano &#x0430;&#x043A;&#x0442;&#x0438;&#x0432;&#x043D;&#x043E; &#x0438;&#x0441;&#x043F;&#x043E;&#x043B;&#x044C;&#x0437;&#x0443;&#x0435;&#x0442;&#x0441;&#x044F; &#x0434;&#x043B;&#x044F; &#x043F;&#x043E;&#x0441;&#x0442;&#x0440;&#x043E;&#x0435;&#x043D;&#x0438;&#x044F; &#x043C;&#x043E;&#x0434;&#x0435;&#x043B;&#x0435;&#x0439; &#x0433;&#x043B;&#x0443;&#x0431;&#x043E;&#x043A;&#x043E;&#x0433;&#x043E; &#x043E;&#x0431;&#x0443;&#x0447;&#x0435;&#x043D;&#x0438;&#x044F;, &#x0430;
&#x0442;&#x0430;&#x043A;&#x0436;&#x0435; &#x0434;&#x043B;&#x044F; &#x043F;&#x043E;&#x0441;&#x0442;&#x0440;&#x043E;&#x0435;&#x043D;&#x0438;&#x044F; &#x0431;&#x043E;&#x043B;&#x0435;&#x0435; &#x0441;&#x043F;&#x0435;&#x0446;&#x0438;&#x0430;&#x043B;&#x0438;&#x0437;&#x0438;&#x0440;&#x043E;&#x0432;&#x0430;&#x043D;&#x043D;&#x044B;&#x0445; &#x0431;&#x0438;&#x0431;&#x043B;&#x0438;&#x043E;&#x0442;&#x0435;&#x043A;. &#x0424;&#x0443;&#x043D;&#x043A;&#x0446;&#x0438;&#x0438; &#x0432;&#x044B;&#x0447;&#x0438;&#x0441;&#x043B;&#x0435;&#x043D;&#x0438;&#x0439; Theano

&#x043A;&#x043E;&#x043C;&#x043F;&#x0438;&#x043B;&#x0438;&#x0440;&#x0443;&#x044E;&#x0442;&#x0441;&#x044F;, &#x0447;&#x0442;&#x043E; &#x043F;&#x043E;&#x0437;&#x0432;&#x043E;&#x043B;&#x044F;&#x0435;&#x0442; &#x0432;&#x044B;&#x043F;&#x043E;&#x043B;&#x043D;&#x044F;&#x0442;&#x044C; &#x0432;&#x044B;&#x0447;&#x0438;&#x0441;&#x043B;&#x0435;&#x043D;&#x0438;&#x044F; &#x0437;&#x0430; &#x043F;&#x0440;&#x0438;&#x0435;&#x043C;&#x043B;&#x0435;&#x043C;&#x043E;&#x0435; &#x0432;&#x0440;&#x0435;&#x043C;&#x044F;. &#x0414;&#x0440;&#x0443;&#x0433;&#x043E;&#x0439;
&#x043E;&#x0442;&#x043B;&#x0438;&#x0447;&#x0438;&#x0442;&#x0435;&#x043B;&#x044C;&#x043D;&#x043E;&#x0439; &#x043E;&#x0441;&#x043E;&#x0431;&#x0435;&#x043D;&#x043D;&#x043E;&#x0441;&#x0442;&#x044C;&#x044E; Theano &#x044F;&#x0432;&#x043B;&#x044F;&#x0435;&#x0442;&#x0441;&#x044F; &#x0432;&#x043E;&#x0437;&#x043C;&#x043E;&#x0436;&#x043D;&#x043E;&#x0441;&#x0442;&#x044C; &#x043F;&#x0440;&#x0438;&#x043C;&#x0435;&#x043D;&#x0435;&#x043D;&#x0438;&#x044F; &#x0433;&#x0440;&#x0430;&#x0444;&#x0438;&#x0447;&#x0435;&#x0441;&#x043A;&#x043E;&#x0433;&#x043E;
&#x043F;&#x0440;&#x043E;&#x0446;&#x0435;&#x0441;&#x0441;&#x043E;&#x0440;&#x0430; &#x0441; &#x0438;&#x0441;&#x043F;&#x043E;&#x043B;&#x044C;&#x0437;&#x043E;&#x0432;&#x0430;&#x043D;&#x0438;&#x0435;&#x043C; &#x0430;&#x0440;&#x0445;&#x0438;&#x0442;&#x0435;&#x043A;&#x0442;&#x0443;&#x0440;&#x044B; &#x043F;&#x0430;&#x0440;&#x0430;&#x043B;&#x043B;&#x0435;&#x043B;&#x044C;&#x043D;&#x044B;&#x0445; &#x0432;&#x044B;&#x0447;&#x0438;&#x0441;&#x043B;&#x0435;&#x043D;&#x0438;&#x0439; CUDA.
&#x0422;&#x0430;&#x043A;&#x0436;&#x0435; &#x0432; &#x044D;&#x043A;&#x0441;&#x043F;&#x0435;&#x0440;&#x0438;&#x043C;&#x0435;&#x043D;&#x0442;&#x0430;&#x043B;&#x044C;&#x043D;&#x043E;&#x043C; &#x0440;&#x0435;&#x0436;&#x0438;&#x043C;&#x0435; &#x0434;&#x043E;&#x0441;&#x0442;&#x0443;&#x043F;&#x043D;&#x0430; &#x0432;&#x043E;&#x0437;&#x043C;&#x043E;&#x0436;&#x043D;&#x043E;&#x0441;&#x0442;&#x044C; &#x043F;&#x0440;&#x0438;&#x043C;&#x0435;&#x043D;&#x0438;&#x0442;&#x044C; &#x0438;&#x043D;&#x0442;&#x0435;&#x0440;&#x0444;&#x0435;&#x0439;&#x0441;
OpenCL.
<!--l. 38--><p class="noindent" ><span class="paragraphHead"><a 
 id="x1-1000"></a><span 
class="labx-1200">&#x0424;&#x043E;&#x0440;&#x043C;&#x0430;&#x043B;&#x044C;&#x043D;&#x0430;&#x044F; &#x043F;&#x043E;&#x0441;&#x0442;&#x0430;&#x043D;&#x043E;&#x0432;&#x043A;&#x0430; &#x0437;&#x0430;&#x0434;&#x0430;&#x0447;&#x0438;</span></span>
   &#x041F;&#x0443;&#x0441;&#x0442;&#x044C; &#x0437;&#x0430;&#x0434;&#x0430;&#x043D;&#x0430; &#x0432;&#x044B;&#x0431;&#x043E;&#x0440;&#x043A;&#x0430;
   <table 
class="equation"><tr><td><a 
 id="x1-1001r1"></a>
   <center class="math-display" >
<img 
src="article20x.png" alt="&#x1D507;  = {(xi,yi)},i = 1,...,N,
" class="math-display" ></center></td><td class="equation-label">(1)</td></tr></table>
<!--l. 39--><p class="nopar" >
&#x0441;&#x043E;&#x0441;&#x0442;&#x043E;&#x044F;&#x0449;&#x0430;&#x044F; &#x0438;&#x0437; &#x043C;&#x043D;&#x043E;&#x0436;&#x0435;&#x0441;&#x0442;&#x0432;&#x0430; &#x043F;&#x0430;&#x0440; «&#x043E;&#x0431;&#x044A;&#x0435;&#x043A;&#x0442; &#8211; &#x043A;&#x043B;&#x0430;&#x0441;&#x0441;», <span 
class="cmbx-12">x</span><sub><span 
class="cmmi-8">i</span></sub> <span 
class="cmsy-10x-x-120">&#x2208; </span><span 
class="msbm-10x-x-120">&#x211D;</span><sup><span 
class="cmmi-8">n</span></sup>. &#x041A;&#x0430;&#x0436;&#x0434;&#x044B;&#x0439; &#x043E;&#x0431;&#x044A;&#x0435;&#x043A;&#x0442; <span 
class="cmbx-12">x </span>&#x043F;&#x0440;&#x0438;&#x043D;&#x0430;&#x0434;&#x043B;&#x0435;&#x0436;&#x0438;&#x0442;
&#x043E;&#x0434;&#x043D;&#x043E;&#x043C;&#x0443; &#x0438;&#x0437; <span 
class="cmmi-12">Z </span>&#x043A;&#x043B;&#x0430;&#x0441;&#x0441;&#x043E;&#x0432; &#x0441; &#x043C;&#x0435;&#x0442;&#x043A;&#x043E;&#x0439; <span 
class="cmmi-12">y</span><sub><span 
class="cmmi-8">i</span></sub> <span 
class="cmsy-10x-x-120">&#x2208; </span><span 
class="cmbx-12">Y </span><span 
class="cmr-12">= </span><span 
class="cmsy-10x-x-120">{</span><span 
class="cmr-12">1</span><span 
class="cmmi-12">,</span><span 
class="cmmi-12">&#x2026;</span><span 
class="cmmi-12">,Z</span><span 
class="cmsy-10x-x-120">}</span>.
<!--l. 41--><p class="indent" >   &#x041C;&#x043E;&#x0434;&#x0435;&#x043B;&#x044C;&#x044E; &#x043A;&#x043B;&#x0430;&#x0441;&#x0441;&#x0438;&#x0444;&#x0438;&#x043A;&#x0430;&#x0446;&#x0438;&#x0438; &#x0438;&#x043B;&#x0438; &#x0441;&#x0435;&#x0442;&#x044C;&#x044E; &#x0433;&#x043B;&#x0443;&#x0431;&#x043E;&#x043A;&#x043E;&#x0433;&#x043E; &#x043E;&#x0431;&#x0443;&#x0447;&#x0435;&#x043D;&#x0438;&#x044F; <span 
class="cmbx-12">f </span>&#x043D;&#x0430;&#x0437;&#x043E;&#x0432;&#x0435;&#x043C; &#x0441;&#x0443;&#x043F;&#x0435;&#x0440;&#x043F;&#x043E;&#x0437;&#x0438;&#x0446;&#x0438;&#x044E;
&#x0444;&#x0443;&#x043D;&#x043A;&#x0446;&#x0438;&#x0439;
   <table 
class="equation"><tr><td><a 
 id="x1-1002r2"></a>
   <center class="math-display" >
<img 
src="article21x.png" alt="f(w, x ) = &#x03BC; (&#x03BC; (&#x03BC;  (x))) : &#x211D;n &#x2192; [0,1 ]Z ,
            3  2   1
" class="math-display" ></center></td><td class="equation-label">(2)</td></tr></table>
<!--l. 45--><p class="nopar" >
&#x0433;&#x0434;&#x0435; <span 
class="cmmib-10x-x-120">&#x03BC;</span><sub><span 
class="cmmi-8">k</span></sub><span 
class="cmmi-12">,k </span><span 
class="cmsy-10x-x-120">&#x2208;{</span><span 
class="cmr-12">1</span><span 
class="cmmi-12">,</span><span 
class="cmmi-12">&#x2026;</span><span 
class="cmmi-12">, </span><span 
class="cmr-12">3</span><span 
class="cmsy-10x-x-120">}</span><span 
class="cmmi-12">, </span>&#8212; &#x043C;&#x043E;&#x0434;&#x0435;&#x043B;&#x0438;, &#x043F;&#x0430;&#x0440;&#x0430;&#x043C;&#x0435;&#x0442;&#x0440;&#x0438;&#x0447;&#x0435;&#x0441;&#x043A;&#x043E;&#x0435; &#x0441;&#x0435;&#x043C;&#x0435;&#x0439;&#x0441;&#x0442;&#x0432;&#x043E; &#x0432;&#x0435;&#x043A;&#x0442;&#x043E;&#x0440;-&#x0444;&#x0443;&#x043D;&#x043A;&#x0446;&#x0438;&#x0438;; <span 
class="cmbx-12">w </span>&#8212; &#x0432;&#x0435;&#x043A;&#x0442;&#x043E;&#x0440;
&#x043F;&#x0430;&#x0440;&#x0430;&#x043C;&#x0435;&#x0442;&#x0440;&#x043E;&#x0432; &#x043C;&#x043E;&#x0434;&#x0435;&#x043B;&#x0435;&#x0439;; <span 
class="cmmi-12">r</span>-&#x044E; &#x043A;&#x043E;&#x043C;&#x043F;&#x043E;&#x043D;&#x0435;&#x043D;&#x0442;&#x0443; &#x0432;&#x0435;&#x043A;&#x0442;&#x043E;&#x0440;&#x0430; <span 
class="cmbx-12">f</span><span 
class="cmr-12">(</span><span 
class="cmbx-12">x</span><span 
class="cmmi-12">,</span><span 
class="cmbx-12">w</span><span 
class="cmr-12">) </span>&#x0431;&#x0443;&#x0434;&#x0435;&#x043C; &#x0438;&#x043D;&#x0442;&#x0435;&#x0440;&#x043F;&#x0440;&#x0435;&#x0442;&#x0438;&#x0440;&#x043E;&#x0432;&#x0430;&#x0442;&#x044C; &#x043A;&#x0430;&#x043A;
&#x0432;&#x0435;&#x0440;&#x043E;&#x044F;&#x0442;&#x043D;&#x043E;&#x0441;&#x0442;&#x044C; &#x043E;&#x0442;&#x043D;&#x0435;&#x0441;&#x0435;&#x043D;&#x0438;&#x044F; &#x043E;&#x0431;&#x044A;&#x0435;&#x043A;&#x0442;&#x0430; <span 
class="cmbx-12">x</span><sub><span 
class="cmmi-8">i</span></sub> &#x043A; &#x043A;&#x043B;&#x0430;&#x0441;&#x0441;&#x0443; &#x0441; &#x043C;&#x0435;&#x0442;&#x043A;&#x043E;&#x0439; <span 
class="cmmi-12">r</span>.
<!--l. 49--><p class="indent" >   &#x0422;&#x0440;&#x0435;&#x0431;&#x0443;&#x0435;&#x0442;&#x0441;&#x044F; &#x043C;&#x0438;&#x043D;&#x0438;&#x043C;&#x0438;&#x0437;&#x0438;&#x0440;&#x043E;&#x0432;&#x0430;&#x0442;&#x044C; &#x0444;&#x0443;&#x043D;&#x043A;&#x0446;&#x0438;&#x044E; &#x043E;&#x0448;&#x0438;&#x0431;&#x043A;&#x0438; <span 
class="cmmi-12">S </span>&#x043D;&#x0430; &#x043E;&#x0431;&#x0443;&#x0447;&#x0430;&#x044E;&#x0449;&#x0435;&#x0439; &#x0432;&#x044B;&#x0431;&#x043E;&#x0440;&#x043A;&#x0435; <span 
class="eufm-10x-x-120">&#x1D507;</span>:

   <center class="math-display" >
<img 
src="article22x.png" alt="&#x02C6;w = argmin  S(w |&#x1D507;),
       w
" class="math-display" ></center>
<!--l. 52--><p class="nopar" > &#x0433;&#x0434;&#x0435; <span 
class="cmmi-12">S </span>&#8212; &#x0441;&#x0443;&#x043C;&#x043C;&#x0430; &#x043E;&#x0442;&#x0440;&#x0438;&#x0446;&#x0430;&#x0442;&#x0435;&#x043B;&#x044C;&#x043D;&#x044B;&#x0445; &#x043B;&#x043E;&#x0433;&#x0430;&#x0440;&#x0438;&#x0444;&#x043C;&#x043E;&#x0432; &#x043F;&#x0440;&#x0430;&#x0432;&#x0434;&#x043E;&#x043F;&#x043E;&#x0434;&#x043E;&#x0431;&#x0438;&#x044F; &#x043F;&#x043E; &#x0432;&#x0441;&#x0435;&#x043C; &#x043E;&#x0431;&#x044A;&#x0435;&#x043A;&#x0442;&#x0430;&#x043C;
&#x0432;&#x044B;&#x0431;&#x043E;&#x0440;&#x043A;&#x0438;:
   <center class="math-display" >
<img 
src="article23x.png" alt="              &#x2211;    &#x2211;Z
S(w |&#x1D507; ) = -          [yi = r]logp(y = r|x,w ).
             (x,y)&#x2208;&#x1D507; r=1
" class="math-display" ></center>
<!--l. 56--><p class="nopar" > &#x0421;&#x0435;&#x0442;&#x044C; &#x0433;&#x043B;&#x0443;&#x0431;&#x043E;&#x043A;&#x043E;&#x0433;&#x043E; &#x043E;&#x0431;&#x0443;&#x0447;&#x0435;&#x043D;&#x0438;&#x044F; &#x0441;&#x043E;&#x0441;&#x0442;&#x043E;&#x0438;&#x0442; &#x0438;&#x0437; &#x0442;&#x0440;&#x0435;&#x0445; &#x043E;&#x0441;&#x043D;&#x043E;&#x0432;&#x043D;&#x044B;&#x0445; &#x043A;&#x043E;&#x043C;&#x043F;&#x043E;&#x043D;&#x0435;&#x043D;&#x0442;: &#x043E;&#x0433;&#x0440;&#x0430;&#x043D;&#x0438;&#x0447;&#x0435;&#x043D;&#x043D;&#x043E;&#x0439; &#x043C;&#x0430;&#x0448;&#x0438;&#x043D;&#x044B;
&#x0411;&#x043E;&#x043B;&#x044C;&#x0446;&#x043C;&#x0430;&#x043D;&#x0430;&#x00A0;<span 
class="cmmib-10x-x-120">&#x03BC;</span><sub><span 
class="cmr-8">1</span></sub>, &#x0430;&#x0432;&#x0442;&#x043E;&#x043A;&#x043E;&#x0434;&#x0438;&#x0440;&#x043E;&#x0432;&#x0449;&#x0438;&#x043A;&#x0430;&#x00A0;<span 
class="cmmib-10x-x-120">&#x03BC;</span><sub><span 
class="cmr-8">2</span></sub> &#x0438; &#x0434;&#x0432;&#x0443;&#x0445;&#x0441;&#x043B;&#x043E;&#x0439;&#x043D;&#x043E;&#x0439; &#x043D;&#x0435;&#x0439;&#x0440;&#x043E;&#x0441;&#x0435;&#x0442;&#x0438; &#x0441; softmax-&#x043A;&#x043B;&#x0430;&#x0441;&#x0441;&#x0438;&#x0444;&#x0438;&#x043A;&#x0430;&#x0442;&#x043E;&#x0440;&#x043E;&#x043C;&#x00A0;<span 
class="cmmib-10x-x-120">&#x03BC;</span><sub><span 
class="cmr-8">3</span></sub>.
<!--l. 61--><p class="noindent" ><span class="paragraphHead"><a 
 id="x1-2000"></a><span 
class="labx-1200">&#x041E;&#x0431;&#x0449;&#x0438;&#x0439; &#x043F;&#x043B;&#x0430;&#x043D; &#x0437;&#x0430;&#x043F;&#x0443;&#x0441;&#x043A;&#x0430; &#x0430;&#x043B;&#x0433;&#x043E;&#x0440;&#x0438;&#x0442;&#x043C;&#x0430;.</span></span>
   &#x0414;&#x043B;&#x044F; &#x0437;&#x0430;&#x043F;&#x0443;&#x0441;&#x043A;&#x0430; &#x0430;&#x043B;&#x0433;&#x043E;&#x0440;&#x0438;&#x0442;&#x043C;&#x0430; &#x043D;&#x0430; &#x0441;&#x0435;&#x0440;&#x0432;&#x0435;&#x0440;&#x0435; AWS &#x0442;&#x0440;&#x0435;&#x0431;&#x0443;&#x0435;&#x0442;&#x0441;&#x044F; &#x0437;&#x0430;&#x0440;&#x0435;&#x0433;&#x0438;&#x0441;&#x0442;&#x0440;&#x0438;&#x0440;&#x043E;&#x0432;&#x0430;&#x0442;&#x044C;&#x0441;&#x044F; &#x043D;&#x0430; AWS,
&#x0441;&#x043A;&#x043E;&#x043D;&#x0444;&#x0438;&#x0433;&#x0443;&#x0440;&#x0438;&#x0440;&#x043E;&#x0432;&#x0430;&#x0442;&#x044C; &#x044D;&#x043A;&#x0437;&#x0435;&#x043C;&#x043F;&#x043B;&#x044F;&#x0440; AWS (instance), &#x0441;&#x043A;&#x043E;&#x043F;&#x0438;&#x0440;&#x043E;&#x0432;&#x0430;&#x0442;&#x044C; &#x043A;&#x043E;&#x0434; &#x0438; &#x0434;&#x0430;&#x043D;&#x043D;&#x044B;&#x0435; &#x043F;&#x0440;&#x043E;&#x0435;&#x043A;&#x0442;&#x0430;
&#x043D;&#x0430; &#x0441;&#x0435;&#x0440;&#x0432;&#x0435;&#x0440; &#x0438; &#x043F;&#x043E;&#x0434;&#x043A;&#x043B;&#x044E;&#x0447;&#x0438;&#x0442;&#x044C;&#x0441;&#x044F; &#x043A; &#x0441;&#x0435;&#x0440;&#x0432;&#x0435;&#x0440;&#x0443; &#x043F;&#x043E; &#x043F;&#x0440;&#x043E;&#x0442;&#x043E;&#x043A;&#x043E;&#x043B;&#x0443; SSH. &#x041F;&#x043E;&#x0441;&#x043B;&#x0435; &#x044D;&#x0442;&#x043E;&#x0433;&#x043E; &#x0442;&#x0440;&#x0435;&#x0431;&#x0443;&#x0435;&#x0442;&#x0441;&#x044F;
&#x0437;&#x0430;&#x0439;&#x0442;&#x0438; &#x0432; &#x043F;&#x0430;&#x043F;&#x043A;&#x0443; &#x0441; &#x043F;&#x0440;&#x043E;&#x0435;&#x043A;&#x0442;&#x043E;&#x043C;, &#x0437;&#x0430;&#x043F;&#x0443;&#x0441;&#x0442;&#x0438;&#x0442;&#x044C; &#x0432;&#x044B;&#x0447;&#x0438;&#x0441;&#x043B;&#x0438;&#x0442;&#x0435;&#x043B;&#x044C;&#x043D;&#x044B;&#x0439; &#x044D;&#x043A;&#x0441;&#x043F;&#x0435;&#x0440;&#x0438;&#x043C;&#x0435;&#x043D;&#x0442;, &#x0441;&#x043A;&#x043E;&#x043F;&#x0438;&#x0440;&#x043E;&#x0432;&#x0430;&#x0442;&#x044C;
&#x043F;&#x043E;&#x043B;&#x0443;&#x0447;&#x0435;&#x043D;&#x043D;&#x044B;&#x0435; &#x0440;&#x0435;&#x0437;&#x0443;&#x043B;&#x044C;&#x0442;&#x0430;&#x0442;&#x044B; &#x044D;&#x043A;&#x0441;&#x043F;&#x0435;&#x0440;&#x0438;&#x043C;&#x0435;&#x043D;&#x0442;&#x0430; &#x043D;&#x0430; &#x043B;&#x043E;&#x043A;&#x0430;&#x043B;&#x044C;&#x043D;&#x044B;&#x0439; &#x043A;&#x043E;&#x043C;&#x043F;&#x044C;&#x044E;&#x0442;&#x0435;&#x0440; &#x0438; &#x0443;&#x043D;&#x0438;&#x0447;&#x0442;&#x043E;&#x0436;&#x0438;&#x0442;&#x044C;
&#x044D;&#x043A;&#x0437;&#x0435;&#x043C;&#x043F;&#x043B;&#x044F;&#x0440;.
<!--l. 64--><p class="noindent" ><span class="paragraphHead"><a 
 id="x1-3000"></a><span 
class="labx-1200">&#x0412;&#x044B;&#x0447;&#x0438;&#x0441;&#x043B;&#x0438;&#x0442;&#x0435;&#x043B;&#x044C;&#x043D;&#x044B;&#x0439; &#x044D;&#x043A;&#x0441;&#x043F;&#x0435;&#x0440;&#x0438;&#x043C;&#x0435;&#x043D;&#x0442;</span></span>
   &#x041D;&#x0430;&#x0431;&#x043E;&#x0440; &#x0434;&#x0430;&#x043D;&#x043D;&#x044B;&#x0445; &#x0441;&#x043E;&#x0434;&#x0435;&#x0440;&#x0436;&#x0438;&#x0442; &#x0437;&#x0430;&#x043F;&#x0438;&#x0441;&#x0438; &#x0434;&#x0432;&#x0438;&#x0436;&#x0435;&#x043D;&#x0438;&#x0439; &#x0434;&#x043B;&#x044F; 6 &#x043A;&#x043B;&#x0430;&#x0441;&#x0441;&#x043E;&#x0432; &#x043F;&#x0435;&#x0440;&#x0435;&#x043C;&#x0435;&#x043D;&#x043D;&#x043E;&#x0439; &#x0434;&#x043B;&#x0438;&#x043D;&#x044B; &#x043F;&#x043E; &#x0442;&#x0440;&#x0435;&#x043C;
&#x043A;&#x043E;&#x043E;&#x0440;&#x0434;&#x0438;&#x043D;&#x0430;&#x0442;&#x0430;&#x043C; &#x0430;&#x043A;&#x0441;&#x0435;&#x043B;&#x0435;&#x0440;&#x043E;&#x043C;&#x0435;&#x0442;&#x0440;&#x0430; &#x043C;&#x043E;&#x0431;&#x0438;&#x043B;&#x044C;&#x043D;&#x043E;&#x0433;&#x043E; &#x0442;&#x0435;&#x043B;&#x0435;&#x0444;&#x043E;&#x043D;&#x0430;. &#x0418;&#x0437; &#x043A;&#x0430;&#x0436;&#x0434;&#x043E;&#x0439; &#x0437;&#x0430;&#x043F;&#x0438;&#x0441;&#x0438; &#x0438;&#x0441;&#x043F;&#x043E;&#x043B;&#x044C;&#x0437;&#x043E;&#x0432;&#x0430;&#x043B;&#x0438;&#x0441;&#x044C;
&#x043F;&#x0435;&#x0440;&#x0432;&#x044B;&#x0435; 200 &#x0441;&#x0435;&#x0433;&#x043C;&#x0435;&#x043D;&#x0442;&#x043E;&#x0432;. &#x041F;&#x0440;&#x0438;&#x043C;&#x0435;&#x0440; &#x0434;&#x0430;&#x043D;&#x043D;&#x044B;&#x0445; &#x0438;&#x0437; &#x0432;&#x044B;&#x0431;&#x043E;&#x0440;&#x043A;&#x0438; WISDM &#x043F;&#x0440;&#x0438;&#x0432;&#x0435;&#x0434;&#x0435;&#x043D; &#x043D;&#x0430; &#x0440;&#x0438;&#x0441;.&#x00A0;<a 
href="#x1-30011">1<!--tex4ht:ref: fig:wisdm --></a>. &#x0422;. &#x043A;.
&#x0432;&#x044B;&#x0431;&#x043E;&#x0440;&#x043A;&#x0430; &#x043D;&#x0435; &#x0441;&#x0431;&#x0430;&#x043B;&#x0430;&#x043D;&#x0441;&#x0438;&#x0440;&#x043E;&#x0432;&#x0430;&#x043D;&#x0430;, &#x0432; &#x043D;&#x0435;&#x0435; &#x0434;&#x043E;&#x0431;&#x0430;&#x0432;&#x043B;&#x044F;&#x043B;&#x0438;&#x0441;&#x044C; &#x043F;&#x043E;&#x0432;&#x0442;&#x043E;&#x0440;&#x044B; &#x0437;&#x0430;&#x043F;&#x0438;&#x0441;&#x0435;&#x0439; &#x043A;&#x043B;&#x0430;&#x0441;&#x0441;&#x043E;&#x0432;, &#x0441;&#x043E;&#x0434;&#x0435;&#x0440;&#x0436;&#x0430;&#x0449;&#x0438;&#x0445;
&#x043A;&#x043E;&#x043B;&#x0438;&#x0447;&#x0435;&#x0441;&#x0442;&#x0432;&#x043E; &#x0437;&#x0430;&#x043F;&#x0438;&#x0441;&#x0435;&#x0439;, &#x043C;&#x0435;&#x043D;&#x044C;&#x0448;&#x0435;&#x0435; &#x0447;&#x0435;&#x043C; &#x0443; &#x0431;&#x043E;&#x043B;&#x044C;&#x0448;&#x0435;&#x0433;&#x043E; &#x043A;&#x043B;&#x0430;&#x0441;&#x0441;&#x0430;.
<!--l. 67--><p class="indent" >   <hr class="figure"><div class="figure" 
>

<a 
 id="x1-30011"></a>

<!--l. 69--><p class="noindent" ><img 
src="article24x.png" alt="PIC" class="graphics"><!--tex4ht:graphics  
name="article24x.png" src="wisdm.pdf"  
-->
<br />  <div class="caption" 
><span class="id">&#x0420;&#x0438;&#x0441;.&#x00A0;1:  </span><span  
class="content">&#x041F;&#x0440;&#x0438;&#x043C;&#x0435;&#x0440;  &#x0432;&#x0440;&#x0435;&#x043C;&#x0435;&#x043D;&#x043D;&#x044B;&#x0445;  &#x0440;&#x044F;&#x0434;&#x043E;&#x0432;  &#x0438;&#x0437;  &#x0432;&#x044B;&#x0431;&#x043E;&#x0440;&#x043A;&#x0438;  WISDM,  &#x043F;&#x0440;&#x043E;&#x0435;&#x043A;&#x0446;&#x0438;&#x044F;  &#x043D;&#x0430;  &#x043F;&#x0435;&#x0440;&#x0432;&#x0443;&#x044E;
&#x043A;&#x043E;&#x043E;&#x0440;&#x0434;&#x0438;&#x043D;&#x0430;&#x0442;&#x0443;.  &#x041F;&#x0440;&#x043E;&#x0435;&#x043A;&#x0446;&#x0438;&#x0438;,  &#x0441;&#x043E;&#x043E;&#x0442;&#x0432;&#x0435;&#x0442;&#x0441;&#x0442;&#x0432;&#x0443;&#x044E;&#x0449;&#x0438;&#x0435;  &#x0441;&#x0438;&#x0434;&#x0435;&#x043D;&#x0438;&#x044E;  &#x0438;  &#x0431;&#x0435;&#x0433;&#x0443;  &#x0431;&#x044B;&#x043B;&#x0438;  &#x0441;&#x0434;&#x0432;&#x0438;&#x043D;&#x0443;&#x0442;&#x044B;  &#x0434;&#x043B;&#x044F;
&#x043D;&#x0430;&#x0433;&#x043B;&#x044F;&#x0434;&#x043D;&#x043E;&#x0441;&#x0442;&#x0438;.</span></div><!--tex4ht:label?: x1-30011 -->

<!--l. 72--><p class="indent" >   </div><hr class="endfigure">
<!--l. 75--><p class="indent" >   <hr class="figure"><div class="figure" 
>

<a 
 id="x1-30022"></a>

<!--l. 77--><p class="noindent" ><img 
src="article25x.png" alt="PIC" class="graphics"><!--tex4ht:graphics  
name="article25x.png" src="neurons.pdf"  
-->
<br /> <div class="caption" 
><span class="id">&#x0420;&#x0438;&#x0441;.&#x00A0;2: </span><span  
class="content">&#x0417;&#x0430;&#x0432;&#x0438;&#x0441;&#x0438;&#x043C;&#x043E;&#x0441;&#x0442;&#x044C; &#x043E;&#x0448;&#x0438;&#x0431;&#x043A;&#x0438; &#x043E;&#x0442; &#x0447;&#x0438;&#x0441;&#x043B;&#x0430; &#x043D;&#x0435;&#x0439;&#x0440;&#x043E;&#x043D;&#x043E;&#x0432;</span></div><!--tex4ht:label?: x1-30022 -->

<!--l. 80--><p class="indent" >   </div><hr class="endfigure">
<!--l. 83--><p class="indent" >   &#x0414;&#x043B;&#x044F; &#x043E;&#x0446;&#x0435;&#x043D;&#x043A;&#x0438; &#x0437;&#x0430;&#x0432;&#x0438;&#x0441;&#x0438;&#x043C;&#x043E;&#x0441;&#x0442;&#x0438; &#x043A;&#x0430;&#x0447;&#x0435;&#x0441;&#x0442;&#x0432;&#x0430; &#x043A;&#x043B;&#x0430;&#x0441;&#x0441;&#x0438;&#x0444;&#x0438;&#x043A;&#x0430;&#x0446;&#x0438;&#x0438; &#x043E;&#x0442; &#x0440;&#x0430;&#x0437;&#x043C;&#x0435;&#x0440;&#x0430; &#x043E;&#x0431;&#x0443;&#x0447;&#x0430;&#x044E;&#x0449;&#x0435;&#x0439; &#x0432;&#x044B;&#x0431;&#x043E;&#x0440;&#x043A;&#x0438; &#x0431;&#x044B;&#x043B;&#x0430;
&#x043F;&#x0440;&#x043E;&#x0432;&#x0435;&#x0434;&#x0435;&#x043D;&#x0430; &#x043A;&#x0440;&#x043E;&#x0441;&#x0441;&#x0432;&#x0430;&#x043B;&#x0438;&#x0434;&#x0430;&#x0446;&#x0438;&#x044F; &#x0441; &#x0444;&#x0438;&#x043A;&#x0441;&#x0438;&#x0440;&#x043E;&#x0432;&#x0430;&#x043D;&#x043D;&#x044B;&#x043C; &#x043A;&#x043E;&#x043B;&#x0438;&#x0447;&#x0435;&#x0441;&#x0442;&#x0432;&#x043E;&#x043C; &#x043E;&#x0431;&#x044A;&#x0435;&#x043A;&#x0442;&#x043E;&#x0432; &#x0432; &#x043E;&#x0431;&#x0443;&#x0447;&#x0430;&#x044E;&#x0449;&#x0435;&#x0439;
&#x0432;&#x044B;&#x0431;&#x043E;&#x0440;&#x043A;&#x0435; (25% &#x0438;&#x0441;&#x0445;&#x043E;&#x0434;&#x043D;&#x043E;&#x0439; &#x0432;&#x044B;&#x0431;&#x043E;&#x0440;&#x043A;&#x0438;) &#x0438; &#x043F;&#x0435;&#x0440;&#x0435;&#x043C;&#x0435;&#x043D;&#x043D;&#x044B;&#x043C; &#x0440;&#x0430;&#x0437;&#x043C;&#x0435;&#x0440;&#x043E;&#x043C; &#x043E;&#x0431;&#x0443;&#x0447;&#x0430;&#x044E;&#x0449;&#x0435;&#x0439; &#x0432;&#x044B;&#x0431;&#x043E;&#x0440;&#x043A;&#x0438;.
&#x0427;&#x0438;&#x0441;&#x043B;&#x043E; &#x043D;&#x0435;&#x0439;&#x0440;&#x043E;&#x043D;&#x043E;&#x0432; &#x0431;&#x044B;&#x043B;&#x043E; &#x0443;&#x0441;&#x0442;&#x0430;&#x043D;&#x043E;&#x0432;&#x043B;&#x0435;&#x043D;&#x043E; &#x043A;&#x0430;&#x043A; 364:224:112. &#x041F;&#x0440;&#x0438; &#x043F;&#x0440;&#x043E;&#x0432;&#x0435;&#x0434;&#x0435;&#x043D;&#x0438;&#x0438; &#x043F;&#x0440;&#x043E;&#x0446;&#x0435;&#x0434;&#x0443;&#x0440;&#x044B;
&#x0441;&#x043A;&#x043E;&#x043B;&#x044C;&#x0437;&#x044F;&#x0449;&#x0435;&#x0433;&#x043E; &#x043A;&#x043E;&#x043D;&#x0442;&#x0440;&#x043E;&#x043B;&#x044F; &#x0434;&#x043B;&#x044F; &#x043A;&#x0430;&#x0436;&#x0434;&#x043E;&#x0433;&#x043E; &#x043E;&#x0442;&#x0441;&#x0447;&#x0435;&#x0442;&#x0430; &#x0431;&#x044B;&#x043B;&#x043E; &#x043F;&#x0440;&#x043E;&#x0438;&#x0437;&#x0432;&#x0435;&#x0434;&#x0435;&#x043D;&#x043E; &#x043F;&#x044F;&#x0442;&#x044C; &#x0437;&#x0430;&#x043F;&#x0443;&#x0441;&#x043A;&#x043E;&#x0432;. &#x0413;&#x0440;&#x0430;&#x0444;&#x0438;&#x043A;
&#x0437;&#x0430;&#x0432;&#x0438;&#x0441;&#x0438;&#x043C;&#x043E;&#x0441;&#x0442;&#x0438; &#x043E;&#x0448;&#x0438;&#x0431;&#x043A;&#x0438; &#x043A;&#x043B;&#x0430;&#x0441;&#x0441;&#x0438;&#x0444;&#x0438;&#x043A;&#x0430;&#x0446;&#x0438;&#x0438; &#x043E;&#x0442; &#x0440;&#x0430;&#x0437;&#x043C;&#x0435;&#x0440;&#x0430; &#x043E;&#x0431;&#x0443;&#x0447;&#x0430;&#x044E;&#x0449;&#x0435;&#x0439; &#x0432;&#x044B;&#x0431;&#x043E;&#x0440;&#x043A;&#x0438; &#x043F;&#x0440;&#x0435;&#x0434;&#x0441;&#x0442;&#x0430;&#x0432;&#x043B;&#x0435;&#x043D; &#x043D;&#x0430;
&#x0440;&#x0438;&#x0441;.&#x00A0;<a 
href="#x1-30033">3<!--tex4ht:ref: fig:samples --></a>.
<!--l. 86--><p class="indent" >   <hr class="figure"><div class="figure" 
>

<a 
 id="x1-30033"></a>

<!--l. 88--><p class="noindent" ><img 
src="article26x.png" alt="PIC" class="graphics"><!--tex4ht:graphics  
name="article26x.png" src="samples.pdf"  
-->
<br /> <div class="caption" 
><span class="id">&#x0420;&#x0438;&#x0441;.&#x00A0;3: </span><span  
class="content">&#x0417;&#x0430;&#x0432;&#x0438;&#x0441;&#x0438;&#x043C;&#x043E;&#x0441;&#x0442;&#x044C; &#x043E;&#x0448;&#x0438;&#x0431;&#x043A;&#x0438; &#x043E;&#x0442; &#x0440;&#x0430;&#x0437;&#x043C;&#x0435;&#x0440;&#x0430; &#x043E;&#x0431;&#x0443;&#x0447;&#x0430;&#x044E;&#x0449;&#x0435;&#x0439; &#x0432;&#x044B;&#x0431;&#x043E;&#x0440;&#x043A;&#x0438;</span></div><!--tex4ht:label?: x1-30033 -->

<!--l. 91--><p class="indent" >   </div><hr class="endfigure">
<!--l. 94--><p class="indent" >   &#x0414;&#x043B;&#x044F; &#x0438;&#x0441;&#x0441;&#x043B;&#x0435;&#x0434;&#x043E;&#x0432;&#x0430;&#x043D;&#x0438;&#x044F; &#x0441;&#x043A;&#x043E;&#x0440;&#x043E;&#x0441;&#x0442;&#x0438; &#x0440;&#x0430;&#x0431;&#x043E;&#x0442;&#x044B; &#x043F;&#x0440;&#x043E;&#x0446;&#x0435;&#x0441;&#x0441;&#x0430; &#x043E;&#x0431;&#x0443;&#x0447;&#x0435;&#x043D;&#x0438;&#x044F; &#x043D;&#x0435;&#x0439;&#x0440;&#x043E;&#x0441;&#x0435;&#x0442;&#x0438; &#x0432; &#x0437;&#x0430;&#x0432;&#x0438;&#x0441;&#x0438;&#x043C;&#x043E;&#x0441;&#x0442;&#x0438; &#x043E;&#x0442;
&#x043A;&#x043E;&#x043D;&#x0444;&#x0438;&#x0433;&#x0443;&#x0440;&#x0430;&#x0446;&#x0438;&#x0438; Theano &#x0431;&#x044B;&#x043B; &#x0441;&#x0434;&#x0435;&#x043B;&#x0430;&#x043D; &#x0441;&#x043B;&#x0435;&#x0434;&#x0443;&#x044E;&#x0449;&#x0438;&#x0439; &#x044D;&#x043A;&#x0441;&#x043F;&#x0435;&#x0440;&#x0438;&#x043C;&#x0435;&#x043D;&#x0442;: &#x043F;&#x0440;&#x043E;&#x0432;&#x043E;&#x0434;&#x0438;&#x043B;&#x043E;&#x0441;&#x044C; &#x043E;&#x0431;&#x0443;&#x0447;&#x0435;&#x043D;&#x0438;&#x0435;
&#x0434;&#x0432;&#x0443;&#x0445;&#x0441;&#x043B;&#x043E;&#x0439;&#x043D;&#x043E;&#x0439; &#x043D;&#x0435;&#x0439;&#x0440;&#x043E;&#x0441;&#x0435;&#x0442;&#x0438; &#x043D;&#x0430; &#x043E;&#x0441;&#x043D;&#x043E;&#x0432;&#x0435; &#x043F;&#x043E;&#x0434;&#x0441;&#x0447;&#x0438;&#x0442;&#x0430;&#x043D;&#x043D;&#x044B;&#x0445; &#x0437;&#x0430;&#x0440;&#x0430;&#x043D;&#x0435;&#x0435; &#x043F;&#x0430;&#x0440;&#x0430;&#x043C;&#x0435;&#x0442;&#x0440;&#x043E;&#x0432; &#x043E;&#x0433;&#x0440;&#x0430;&#x043D;&#x0438;&#x0447;&#x0435;&#x043D;&#x043D;&#x043E;&#x0439; &#x043C;&#x0430;&#x0448;&#x0438;&#x043D;&#x044B;
&#x0411;&#x043E;&#x043B;&#x044C;&#x0446;&#x043C;&#x0430;&#x043D;&#x0430; &#x0438; &#x0430;&#x0432;&#x0442;&#x043E;&#x043A;&#x043E;&#x0434;&#x0438;&#x0440;&#x043E;&#x0432;&#x0449;&#x0438;&#x043A;&#x0430;. &#x041E;&#x0431;&#x0443;&#x0447;&#x0435;&#x043D;&#x0438;&#x0435; &#x043F;&#x0440;&#x043E;&#x0445;&#x043E;&#x0434;&#x0438;&#x043B;&#x043E; &#x0437;&#x0430; 100 &#x0438;&#x0442;&#x0435;&#x0440;&#x0430;&#x0446;&#x0438;&#x0439;. &#x041F;&#x0440;&#x0438; &#x043E;&#x0431;&#x0443;&#x0447;&#x0435;&#x043D;&#x0438;&#x0438;
&#x0430;&#x043B;&#x0433;&#x043E;&#x0440;&#x0438;&#x0442;&#x043C; &#x0437;&#x0430;&#x043F;&#x0443;&#x0441;&#x043A;&#x0430;&#x043B;&#x0441;&#x044F; &#x043F;&#x0430;&#x0440;&#x0430;&#x043B;&#x043B;&#x0435;&#x043B;&#x044C;&#x043D;&#x043E; &#x0441; <span 
class="cmmi-12">n </span>&#x0440;&#x0430;&#x0437;&#x043D;&#x044B;&#x043C;&#x0438; &#x0441;&#x0442;&#x0430;&#x0440;&#x0442;&#x043E;&#x0432;&#x044B;&#x043C;&#x0438; &#x043F;&#x043E;&#x0437;&#x0438;&#x0446;&#x0438;&#x044F;&#x043C;&#x0438;, <span 
class="cmmi-12">n </span><span 
class="cmsy-10x-x-120">&#x2208;{</span><span 
class="cmr-12">1</span><span 
class="cmmi-12">,</span><span 
class="cmmi-12">&#x2026;</span><span 
class="cmmi-12">, </span><span 
class="cmr-12">4</span><span 
class="cmsy-10x-x-120">}</span><span 
class="cmmi-12">. </span>&#x0427;&#x0438;&#x0441;&#x043B;&#x043E;
&#x043D;&#x0435;&#x0439;&#x0440;&#x043E;&#x043D;&#x043E;&#x0432; &#x0431;&#x044B;&#x043B;&#x043E; &#x0443;&#x0441;&#x0442;&#x0430;&#x043D;&#x043E;&#x0432;&#x043B;&#x0435;&#x043D;&#x043E; &#x043A;&#x0430;&#x043A; 300:200:100. &#x0417;&#x0430;&#x043F;&#x0443;&#x0441;&#x043A; &#x043E;&#x0441;&#x0443;&#x0449;&#x0435;&#x0441;&#x0442;&#x0432;&#x043B;&#x044F;&#x043B;&#x0441;&#x044F; &#x0441;&#x043E; &#x0441;&#x043B;&#x0435;&#x0434;&#x0443;&#x044E;&#x0449;&#x0438;&#x043C;&#x0438;
&#x043A;&#x043E;&#x043D;&#x0444;&#x0438;&#x0433;&#x0443;&#x0440;&#x0430;&#x0446;&#x0438;&#x044F;&#x043C;&#x0438; Theano:
      <ul class="itemize1">
      <li class="itemize">&#x0432;&#x044B;&#x0447;&#x0438;&#x0441;&#x043B;&#x0435;&#x043D;&#x0438;&#x0435; &#x043D;&#x0430; &#x0446;&#x0435;&#x043D;&#x0442;&#x0440;&#x0430;&#x043B;&#x044C;&#x043D;&#x043E;&#x043C; &#x043F;&#x0440;&#x043E;&#x0446;&#x0435;&#x0441;&#x0441;&#x043E;&#x0440;&#x0435;, &#x0437;&#x0430;&#x0434;&#x0435;&#x0439;&#x0441;&#x0442;&#x0432;&#x043E;&#x0432;&#x0430;&#x043D;&#x043E; &#x043E;&#x0434;&#x043D;&#x043E; &#x044F;&#x0434;&#x0440;&#x043E;;
      </li>
      <li class="itemize">&#x0432;&#x044B;&#x0447;&#x0438;&#x0441;&#x043B;&#x0435;&#x043D;&#x0438;&#x0435; &#x043D;&#x0430; &#x0446;&#x0435;&#x043D;&#x0442;&#x0440;&#x0430;&#x043B;&#x044C;&#x043D;&#x043E;&#x043C; &#x043F;&#x0440;&#x043E;&#x0446;&#x0435;&#x0441;&#x0441;&#x043E;&#x0440;&#x0435;, &#x0437;&#x0430;&#x0434;&#x0435;&#x0439;&#x0441;&#x0442;&#x0432;&#x043E;&#x0432;&#x0430;&#x043D;&#x043E; &#x0447;&#x0435;&#x0442;&#x044B;&#x0440;&#x0435; &#x044F;&#x0434;&#x0440;&#x0430;;
      </li>
      <li class="itemize">&#x0432;&#x044B;&#x0447;&#x0438;&#x0441;&#x043B;&#x0435;&#x043D;&#x0438;&#x0435; &#x043D;&#x0430; &#x0446;&#x0435;&#x043D;&#x0442;&#x0440;&#x0430;&#x043B;&#x044C;&#x043D;&#x043E;&#x043C; &#x043F;&#x0440;&#x043E;&#x0446;&#x0435;&#x0441;&#x0441;&#x043E;&#x0440;&#x0435;, &#x0437;&#x0430;&#x0434;&#x0435;&#x0439;&#x0441;&#x0442;&#x0432;&#x043E;&#x0432;&#x0430;&#x043D;&#x043E; &#x0432;&#x043E;&#x0441;&#x0435;&#x043C;&#x044C; &#x044F;&#x0434;&#x0435;&#x0440;;
      </li>
      <li class="itemize">&#x0432;&#x044B;&#x0447;&#x0438;&#x0441;&#x043B;&#x0435;&#x043D;&#x0438;&#x0435; &#x043D;&#x0430; &#x0433;&#x0440;&#x0430;&#x0444;&#x0438;&#x0447;&#x0435;&#x0441;&#x043A;&#x043E;&#x043C; &#x043F;&#x0440;&#x043E;&#x0446;&#x0435;&#x0441;&#x0441;&#x043E;&#x0440;&#x0435;.</li></ul>
<!--l. 105--><p class="indent" >   &#x0420;&#x0435;&#x0437;&#x0443;&#x043B;&#x044C;&#x0442;&#x0430;&#x0442;&#x044B; &#x044D;&#x043A;&#x0441;&#x043F;&#x0435;&#x0440;&#x0438;&#x043C;&#x0435;&#x043D;&#x0442;&#x0430; &#x043F;&#x0440;&#x0438;&#x0432;&#x0435;&#x0434;&#x0435;&#x043D;&#x044B; &#x043D;&#x0430; &#x0440;&#x0438;&#x0441;.&#x00A0;<a 
href="#x1-30044">4<!--tex4ht:ref: fig:speed --></a>. &#x041A;&#x0430;&#x043A; &#x0432;&#x0438;&#x0434;&#x043D;&#x043E; &#x0438;&#x0437; &#x0433;&#x0440;&#x0430;&#x0444;&#x0438;&#x043A;&#x0430;, &#x0432;&#x044B;&#x0447;&#x0438;&#x0441;&#x043B;&#x0435;&#x043D;&#x0438;&#x0435; &#x0441;
&#x0438;&#x0441;&#x043F;&#x043E;&#x043B;&#x044C;&#x0437;&#x043E;&#x0432;&#x0430;&#x043D;&#x0438;&#x0435;&#x043C; CUDA &#x043F;&#x043E;&#x043A;&#x0430;&#x0437;&#x044B;&#x0432;&#x0430;&#x0435;&#x0442; &#x0437;&#x043D;&#x0430;&#x0447;&#x0438;&#x0442;&#x0435;&#x043B;&#x044C;&#x043D;&#x043E;&#x0435; &#x0443;&#x0441;&#x043A;&#x043E;&#x0440;&#x0435;&#x043D;&#x0438;&#x0435; &#x043F;&#x043E; &#x0441;&#x0440;&#x0430;&#x0432;&#x043D;&#x0435;&#x043D;&#x0438;&#x044E; &#x0441; &#x0432;&#x044B;&#x0447;&#x0438;&#x0441;&#x043B;&#x0435;&#x043D;&#x0438;&#x0435;&#x043C; &#x043D;&#x0430;
&#x0446;&#x0435;&#x043D;&#x0442;&#x0440;&#x0430;&#x043B;&#x044C;&#x043D;&#x043E;&#x043C; &#x043F;&#x0440;&#x043E;&#x0446;&#x0435;&#x0441;&#x0441;&#x043E;&#x0440;&#x0435;. &#x0414;&#x0435;&#x0442;&#x0430;&#x043B;&#x044C;&#x043D;&#x043E;&#x0435; &#x043E;&#x043F;&#x0438;&#x0441;&#x0430;&#x043D;&#x0438;&#x0435; &#x0441;&#x0442;&#x0440;&#x0443;&#x043A;&#x0442;&#x0443;&#x0440;&#x044B; &#x043D;&#x0435;&#x0439;&#x0440;&#x043E;&#x0441;&#x0435;&#x0442;&#x0438; &#x043C;&#x043E;&#x0436;&#x043D;&#x043E; &#x043D;&#x0430;&#x0439;&#x0442;&#x0438; &#x0432; &#x0441;&#x0442;&#x0430;&#x0442;&#x044C;&#x0435;
<span 
class="lati-1200">&#x0411;&#x0430;&#x0445;&#x0442;&#x0435;&#x0435;&#x0432; &#x041E;. &#x042E;., &#x041F;&#x043E;&#x043F;&#x043E;&#x0432;&#x0430; &#x041C;.&#x0421;., &#x0421;&#x0442;&#x0440;&#x0438;&#x0436;&#x043E;&#x0432; &#x0412;.&#x0412;.  </span>&#x0421;&#x0438;&#x0441;&#x0442;&#x0435;&#x043C;&#x044B; &#x0438; &#x0441;&#x0440;&#x0435;&#x0434;&#x0441;&#x0442;&#x0432;&#x0430; &#x0433;&#x043B;&#x0443;&#x0431;&#x043E;&#x043A;&#x043E;&#x0433;&#x043E; &#x043E;&#x0431;&#x0443;&#x0447;&#x0435;&#x043D;&#x0438;&#x044F;
&#x0432; &#x0437;&#x0430;&#x0434;&#x0430;&#x0447;&#x0430;&#x0445; &#x043A;&#x043B;&#x0430;&#x0441;&#x0441;&#x0438;&#x0444;&#x0438;&#x043A;&#x0430;&#x0446;&#x0438;&#x0438; // &#x0421;&#x0438;&#x0441;&#x0442;&#x0435;&#x043C;&#x044B; &#x0438; &#x0441;&#x0440;&#x0435;&#x0434;&#x0441;&#x0442;&#x0432;&#x0430; &#x0438;&#x043D;&#x0444;&#x043E;&#x0440;&#x043C;&#x0430;&#x0442;&#x0438;&#x043A;&#x0438;. &#8212; 2016. &#8212; &#x2116;
2.
<!--l. 108--><p class="indent" >   <hr class="figure"><div class="figure" 
>

<a 
 id="x1-30044"></a>

<!--l. 110--><p class="noindent" ><img 
src="article27x.png" alt="PIC" class="graphics"><!--tex4ht:graphics  
name="article27x.png" src="result.pdf"  
-->
<br /> <div class="caption" 
><span class="id">&#x0420;&#x0438;&#x0441;.&#x00A0;4: </span><span  
class="content">&#x0420;&#x0435;&#x0437;&#x0443;&#x043B;&#x044C;&#x0442;&#x0430;&#x0442;&#x044B; &#x044D;&#x043A;&#x0441;&#x043F;&#x0435;&#x0440;&#x0438;&#x043C;&#x0435;&#x043D;&#x0442;&#x0430; &#x043F;&#x043E; &#x0438;&#x0441;&#x0441;&#x043B;&#x0435;&#x0434;&#x043E;&#x0432;&#x0430;&#x043D;&#x0438;&#x044E; &#x0441;&#x043A;&#x043E;&#x0440;&#x043E;&#x0441;&#x0442;&#x0438; &#x043F;&#x0440;&#x043E;&#x0446;&#x0435;&#x0441;&#x0441;&#x0430; &#x043E;&#x0431;&#x0443;&#x0447;&#x0435;&#x043D;&#x0438;&#x044F;</span></div><!--tex4ht:label?: x1-30044 -->

<!--l. 113--><p class="indent" >   </div><hr class="endfigure">
    
</body></html> 



